nodeiot/ESP32RemoteIO/src/ESP32RemoteIO.cpp
/*
######################################################################
##      Integração das tecnologias da REMOTE IO com Node IOT        ##
##                          Version 1.0                             ##
##   Código base para implementação de projetos de digitalização de ##
##   processos, automação, coleta de dados e envio de comandos com  ##
##   controle embarcado e na nuvem.                                 ##
##                                                                  ##
######################################################################
*/

#include "ESP32RemoteIO.h";
#include "index_html.h";

RemoteIO::RemoteIO()
{
  _appPort = 5000;

  server = new AsyncWebServer(80);
  deviceConfig = new Preferences();

  anchor_route = "http://anchor_IP/post-message";
  anchored_route = "http://anchored_IP/post-message";

  state = "";
  token = "";
    
  configurations = configurationDocument.to<JsonArray>();
  setIO = configurations.createNestedObject();

  Connected = false;
  Socketed = 0;
  messageTimestamp = 0;

  connection_state = INICIALIZATION;
  next_state = INICIALIZATION;

  start_debounce_time = 0;
  start_browsing_time = 0;
  start_reconnect_time = 0;
  start_config_time = 0;
  start_reset_time = 0;

  lastIP_index = -1;
  anchored = false;
  anchoring = false;
}

void RemoteIO::begin()
{
  Serial.begin(115200);

  deviceConfig->begin("deviceConfig", false);

  if (!SPIFFS.begin(true))
  {
    //Serial.println("An Error has occurred while mounting SPIFFS");
    return;
  }

  String NVS_SSID = deviceConfig->getString("ssid", "");
  String NVS_PASSWORD = deviceConfig->getString("password", "");
  String NVS_COMPANYNAME = deviceConfig->getString("companyName", "");
  String NVS_DEVICEID = deviceConfig->getString("deviceId", "");
  String NVS_MODEL = deviceConfig->getString("model", "");
  String NVS_IOSETTINGS = deviceConfig->getString("ioSettings", "");

  server->on("/monitor-data", HTTP_GET, [this](AsyncWebServerRequest *request) {
      
      StaticJsonDocument<1024> monitor_doc;
      String wifi_state; 
      uint32_t flashSize = 0;
      esp_flash_get_size(NULL, &flashSize);
      flashSize = flashSize / 1024;

      if (WiFi.status() == WL_CONNECTED) wifi_state = "Conectado";
      else wifi_state = "Desconectado";

      if (state == "accepted") monitor_doc["NodeIoT"]["authentication"] = "Verificado";
      else monitor_doc["NodeIoT"]["authentication"] = "Não verificado";

      if (Connected) monitor_doc["NodeIoT"]["connection"] = "Conectado";
      else monitor_doc["NodeIoT"]["connection"] = "Desconectado";

      monitor_doc["Wi-Fi"]["ssid"] = _ssid;
      monitor_doc["Wi-Fi"]["ipLocal"] = WiFi.localIP().toString();
      monitor_doc["Wi-Fi"]["state"] = wifi_state;
      monitor_doc["Wi-Fi"]["rssi"] = WiFi.RSSI();
      monitor_doc["RemoteIO"]["model"] = _model;
      monitor_doc["RemoteIO"]["memory"] = flashSize;
      monitor_doc["NodeIoT"]["companyName"] = _companyName;
      monitor_doc["NodeIoT"]["deviceId"] = _deviceId;

      String monitor_info;
      serializeJson(monitor_doc, monitor_info);
      monitor_doc.clear();
      
      request->send(200, "application/json", monitor_info);
  });

  server->on("/monitor", HTTP_GET, [this](AsyncWebServerRequest *request) {
      
      request->send_P(200, "text/html", page_monitor);
  });

  server->on("/monitor-reset", HTTP_GET, [this](AsyncWebServerRequest *request) {
      
      deviceConfig->begin("deviceConfig", false);
      deviceConfig->clear();
      deviceConfig->end();
      request->send(200, "text/plain", "Reset de credenciais efetuado com sucesso! Reiniciando dispositivo...");
      delay(1000);
      ESP.restart();
  });

  if (NVS_SSID.length() == 0 || NVS_PASSWORD.length() == 0 || NVS_COMPANYNAME.length() == 0 || NVS_DEVICEID.length() == 0 || NVS_MODEL.length() == 0)
  {
    startAccessPoint();
  }
  else
  {
    deviceConfig->end();

    _ssid = NVS_SSID;
    _password = NVS_PASSWORD;
    _companyName = NVS_COMPANYNAME;
    _deviceId = NVS_DEVICEID;
    _model = NVS_MODEL;

    appBaseUrl = "https://api.nodeiot.app.br/api";
    appVerifyUrl = appBaseUrl + "/devices/verify";
    appPostData = appBaseUrl + "/broker/data/";
    appSideDoor = appBaseUrl + "/devices/devicedisconnected";
    appPostDataFromAnchored = appBaseUrl + "/broker/ahamdata";
    appLastDataUrl = appBaseUrl + "/devices/getdata/" + _companyName + "/" + _deviceId;

    nodeIotConnection();

    String LOCAL_DOMAIN = String("niot-") + String(_deviceId);

    if (!MDNS.begin(LOCAL_DOMAIN)) 
    {
      //Serial.println("Erro ao configurar o mDNS");
    }

    AsyncCallbackJsonWebHandler* handler = new AsyncCallbackJsonWebHandler("/post-message", [this](AsyncWebServerRequest *request, JsonVariant &json) {
      StaticJsonDocument<250> data;
      String response;
      if (json.is<JsonArray>())
      {
        data = json.as<JsonArray>();
      }
      else if (json.is<JsonObject>())
      {
        data = json.as<JsonObject>();
      }
      
      //Serial.print("[AsyncCallback]: ");
      //Serial.println(data.as<String>());

      if (data.containsKey("status"))
      {
        if (connection_state == CONNECTED)
        {
          data.remove("status");
          data["ipAddress"] = request->client()->remoteIP().toString();

          serializeJson(data, send_to_niot_buffer);

          if (espPOST(appSideDoor, "", send_to_niot_buffer) == HTTP_CODE_OK)
          {
            send_to_niot_buffer.clear();
            data.clear();
            
            if (anchoring) 
            {
              data["msg"] = "ok";
              anchoring = false;
            }
            else data["msg"] = "received";

            serializeJson(data, response);
            request->send(200, "application/json", response);
          }
          else 
          {
            send_to_niot_buffer.clear();
            data.clear();
            data["msg"] = "post to niot failed";
            serializeJson(data, response);
            request->send(500, "application/json", response);
          }
        }
        else 
        {
          if (request->client()->remoteIP().toString() == anchor_IP) 
          {
            anchor_IP.clear();
            anchored = false;
          }

          data.clear();
          data["msg"] = "disconnected";
          serializeJson(data, response);
          request->send(500, "application/json", response);
        }
      }
      else if (data.containsKey("ref") && !data.containsKey("deviceId") && connection_state == DISCONNECTED)
      {
        anchor_IP.clear();
        anchor_IP = request->client()->remoteIP().toString();
        anchored = true;
        
