nodeiot/ESP32RemoteIO/src/ESP32RemoteIO.cpp
        String ref = data["ref"].as<String>();
        setIO[ref]["value"] = data["value"];
        
        if (setIO[ref]["Mode"] == "OUTPUT")
        {
          updatePinOutput(ref);
        }

        data.clear();
        data["msg"] = "ok";
        serializeJson(data, response);
        request->send(200, "application/json", response);

        if (ref == "restart") ESP.restart();
        else if (ref == "reset")
        {
          deviceConfig->begin("deviceConfig", false);
          deviceConfig->clear();
          deviceConfig->end();
          delay(1000);
          ESP.restart();
        }
      }
      else if (data.containsKey("deviceId"))
      {
        if (connection_state == CONNECTED)
        {
          serializeJson(data, send_to_niot_buffer);
          if (espPOST(appPostDataFromAnchored, "", send_to_niot_buffer) == HTTP_CODE_OK)
          {
            send_to_niot_buffer.clear();
            data.clear();
            data["msg"] = "ok";
            serializeJson(data, response);
            request->send(200, "application/json", response);
          }
          else 
          {
            send_to_niot_buffer.clear();
            data.clear();
            data["msg"] = "post to niot failed";
            serializeJson(data, response);
            request->send(500, "application/json", response);
          }
        }
        else 
        {
          data.clear();
          data["msg"] = "disconnected";
          serializeJson(data, response);
          request->send(500, "application/json", response);
        }
      }
      else 
      {
        data.clear();
        data["msg"] = "unhandled message";
        serializeJson(data, response);
        request->send(500, "application/json", response);
      }
    });
    server->addHandler(handler);
  }

  MDNS.addService("http", "tcp", 80);

  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Origin", "*");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  DefaultHeaders::Instance().addHeader("Access-Control-Allow-Headers", "Content-Type");

  server->onNotFound(std::bind(&RemoteIO::notFound, this, std::placeholders::_1));

  ArduinoOTA.begin();
  server->begin(); 
}

void RemoteIO::checkResetting(long timeInterval)
{
  if (digitalRead(setIO["reset"]["pin"].as<int>()) == LOW)
  {
    if (start_reset_time == 0) start_reset_time = millis();
    else if (millis() - start_reset_time >= timeInterval)
    {
      deviceConfig->begin("deviceConfig", false);
      deviceConfig->clear();
      deviceConfig->end();
      delay(1000);
      ESP.restart();
    }
  }
  else start_reset_time = 0;
}

void RemoteIO::startAccessPoint()
{
  WiFi.disconnect(true);
  WiFi.mode(WIFI_AP_STA);

  File file = SPIFFS.open("/model.json", "r");
  if (!file)
  {
    Serial.println("Failed to open file for reading");
    ESP.restart();
  }

  StaticJsonDocument<100> modelDoc;
  deserializeJson(modelDoc, file);
  file.close();
  deviceConfig->putString("model", modelDoc["model"].as<String>());

  IPAddress apIP(192, 168, 4, 1);

  bool result = WiFi.softAP("RemoteIO");
  if (!result) 
  {
    //Serial.println("Erro ao configurar o ponto de acesso");
    ESP.restart();
  }
  
  WiFi.softAPConfig(apIP, apIP, IPAddress(255, 255, 255, 0));
  
  //Serial.println("Ponto de acesso iniciado");

  IPAddress IP = WiFi.softAPIP();
  //Serial.print("IP do ponto de acesso: ");
  Serial.println(IP);

  String LOCAL_DOMAIN = String("remoteiodevice");

  if (!MDNS.begin(LOCAL_DOMAIN)) 
  {
    Serial.println("Erro ao configurar o mDNS");
  }

  start_config_time = millis();
  
  server->on("/", HTTP_GET, [this](AsyncWebServerRequest *request) {
      request->send_P(200, "text/html", page_setup);
  });
  
  server->on("/get", HTTP_GET, [this](AsyncWebServerRequest *request) {

    if (request->hasParam("ssid") && request->hasParam("password") && request->hasParam("companyName") && request->hasParam("deviceId")) 
    {
      String arg_ssid = request->getParam("ssid")->value();
      String arg_password = request->getParam("password")->value();
      String arg_companyName = request->getParam("companyName")->value();
      String arg_deviceId = request->getParam("deviceId")->value();

      WiFi.begin(arg_ssid, arg_password);
      
      unsigned long startTime = millis();
      const unsigned long timeout = 3000;
      bool connected = false;
      wl_status_t status;

      while (millis() - startTime < timeout) 
      {
        status = WiFi.status();
        if (status == WL_CONNECTED) 
        {
          connected = true;
          break;
        } 
        delay(500); // Ajuste o atraso para 500ms
        esp_task_wdt_reset(); // Alimenta o watchdog timer
      }

      if (status == WL_NO_SSID_AVAIL || status == WL_CONNECT_FAILED || status == WL_CONNECTION_LOST || status == WL_DISCONNECTED)
      {
        request->send_P(200, "text/html", page_setup_fail);
      }
      else if (status == WL_CONNECTED)
      {
        deviceConfig->putString("ssid", arg_ssid);
        deviceConfig->putString("password", arg_password);
        deviceConfig->putString("companyName", arg_companyName);
        deviceConfig->putString("deviceId", arg_deviceId);
        deviceConfig->end();

        request->send_P(200, "text/html", page_setup_success);
        delay(1000);
        ESP.restart();
      }   
    } 
    else 
    {
      request->send(400, "text/plain", "Parâmetros ausentes");
    }
  });
}

void RemoteIO::loop()
{
  ArduinoOTA.handle();
  switchState();
  stateLogic();
  checkResetting(5000); // millisegundos
}

void RemoteIO::browseService(const char * service, const char * proto)
{
  //Serial.printf("Browsing for service _%s._%s.local. ... ", service, proto);
  int n = MDNS.queryService(service, proto);
  if (n == 0) 
  {
    //Serial.println("no services found");
    lastIP_index = -1;
  } 
  else 
  {
    //Serial.print(n);
    //Serial.println(" service(s) found");
    for (int i = 0; i < n; i++) 
    {
      // Print details for each service found
      //Serial.print("  ");
      //Serial.print(i + 1);
      //Serial.print(": ");
      //Serial.print(MDNS.hostname(i));
      //Serial.print(" (");
      //Serial.print(MDNS.IP(i));
      //Serial.print(":");
      //Serial.print(MDNS.port(i));
      //Serial.println(")");

      // pega o IP de um possível âncora
      if ((MDNS.hostname(i).indexOf("niot") != -1) || (MDNS.hostname(i).indexOf("esp32") != -1) || (MDNS.hostname(i).indexOf("esp8266") != -1))
      {
        if (i > lastIP_index)
        {
          lastIP_index = i;
          anchor_IP = MDNS.IP(i).toString();
          return;
        }
        else lastIP_index = -1;
      }
    }
  }
  Serial.println();
}

void RemoteIO::switchState()
{
  switch (connection_state)
  {
    case INICIALIZATION:
      if ((WiFi.status() == WL_CONNECTED) && (Connected == true))
      {
        //Serial.println("[INICIALIZATION] vai pro CONNECTED");
        next_state = CONNECTED;
      }
      else
      {
        next_state = INICIALIZATION;
      }
      break;
      
    case CONNECTED:
      if (WiFi.status() != WL_CONNECTED)
      {
        //Serial.println("[CONNECTED] vai pro NO_WIFI");
        next_state = NO_WIFI;
      }
      else if (!Connected)
      {
        //Serial.println("[CONNECTED] vai pro DISCONNECTED");
        next_state = DISCONNECTED;
      }
      else 
      {
        next_state = CONNECTED;
      }
      break;
      
    case NO_WIFI:
      if (WiFi.status() == WL_CONNECTED)
      {
        //Serial.println("[NO_WIFI] vai pro DISCONNECTED");
        start_debounce_time = 0;
        next_state = DISCONNECTED;
      }
      else 
      {
        next_state = NO_WIFI;
      }
      break;
      
    case DISCONNECTED:
      if (Connected)
      {
        //Serial.println("[DISCONNECTED] vai pro CONNECTED");
        next_state = CONNECTED;
      }
      else if (WiFi.status() != WL_CONNECTED)
      {
        //Serial.println("[DISCONNECTED] vai pro NO_WIFI");  
        next_state = NO_WIFI;
      }
      else 
      {
        next_state = DISCONNECTED;
      }
      break;
  }
  // updates current_state
  connection_state = next_state;
}

