nodeiot/ESP32RemoteIO/src/ESP32RemoteIO.cpp
void RemoteIO::stateLogic()
{
  switch (connection_state)
  {
    case INICIALIZATION:
      
      socketIO.loop(); 
      if (Connected == false)
      {
        socketIOConnect();
      }
      break;
      
    case CONNECTED:
      
      socketIO.loop();
      if (setIO["disconnect"]["value"] == "1")
      {
        socketIO.sendEVENT("disconnect");
      }

      break;
      
    case NO_WIFI:

      if (millis() - start_reconnect_time >= 10000)
      {
        start_reconnect_time = millis();
        start_debounce_time = millis();
        nodeIotConnection(); 
      }
      break;

    case DISCONNECTED:
      
      if (setIO["disconnect"]["value"] == "0")
      {
        socketIO.loop();
        socketIOConnect();
      }
      
      // procura um âncora a cada 5 segundos
      if ((!anchored) && (millis() - start_browsing_time >= 5000))
      {
        browseService("http", "tcp");
        start_browsing_time = millis();

        // se encontrou possível âncora, tenta comunicação
        if (anchor_IP.length() > 0)
        {
          StaticJsonDocument<250> doc;
          doc["status"] = "disconnected";
          doc["mac"] = WiFi.macAddress();
          send_to_anchor_buffer.clear();
          serializeJson(doc, send_to_anchor_buffer);
          doc.clear();

          espPOST(anchor_route, "", send_to_anchor_buffer);          
        }
      }
      
      if (millis() - start_reconnect_time >= 60000)
      {
        start_reconnect_time = millis();
        start_debounce_time = millis();
        nodeIotConnection(); 
      }
      break;
  }
}

void RemoteIO::socketIOEvent(socketIOmessageType_t type, uint8_t *payload, size_t length)
{
  switch (type)
  {
  case sIOtype_DISCONNECT:
    //Serial.printf("[IOc] Disconnected!\n");
    Connected = false;
    break;
  case sIOtype_CONNECT:
    //Serial.printf("[IOc] Connected to url: %s\n", payload);
    socketIO.send(sIOtype_CONNECT, "/");
    break;
  case sIOtype_EVENT:
  {
    char *sptr = NULL;
    int id = strtol((char *)payload, &sptr, 10);

    //Serial.printf("[IOc] get event: %s id: %d\n", payload, id);
    
    if (id)
    {
      payload = (uint8_t *)sptr;
    }

    StaticJsonDocument<1024> doc;
    StaticJsonDocument<250> doc2;
    DeserializationError error = deserializeJson(doc, payload, length);

    if (error)
    {
      //Serial.print(F("[IOc]: deserializeJson() failed: "));
      //Serial.println(error.c_str());
      return;
    }

    String eventName = doc[0];

    //Serial.printf("[IOc] event name: %s\n", eventName.c_str());

    if (doc[1].containsKey("ipdest")) // modo âncora
    {
      doc2["ref"] = doc[1]["ref"];
      doc2["value"] = doc[1]["value"];
      
      anchored_IP = doc[1]["ipdest"].as<String>();
      serializeJson(doc2, send_to_anchored_buffer);
      
      doc2.clear();
      
      espPOST(anchored_route, "", send_to_anchored_buffer);
      send_to_anchored_buffer.clear();
    }
    else 
    {
      String ref = doc[1]["ref"];
      String value = doc[1]["value"];

      if (ref == "restart") ESP.restart();
      else if (ref == "reset")
      {
        deviceConfig->begin("deviceConfig", false);
        deviceConfig->clear();
        deviceConfig->end();
        delay(1000);
        ESP.restart();
      }

      setIO[ref]["value"] = value;

      if (setIO[ref]["Mode"] == "OUTPUT")
      {
        updatePinOutput(ref);
      }
    }
    doc.clear();
  }
  break;
  case sIOtype_ACK:
    //Serial.printf("[IOc] get ack: %u\n", length);
    break;
  case sIOtype_ERROR:
    //Serial.printf("[IOc] get error: %u\n", length);
    break;
  case sIOtype_BINARY_EVENT:
    //Serial.printf("[IOc] get binary: %u\n", length);
    break;
  case sIOtype_BINARY_ACK:
    //Serial.printf("[IOc] get binary ack: %u\n", length);
    break;
  }
}

void RemoteIO::nodeIotConnection()
{
  /*Conexão WiFi*/
  WiFi.disconnect(true);
  Connected = false;
  WiFi.mode(WIFI_STA);
  String hostname = String("niot-") + String(_deviceId);
  WiFi.setHostname(hostname.c_str());
  WiFi.begin(_ssid, _password);

  WiFi.waitForConnectResult();

  while (WiFi.status() != WL_CONNECTED)
  {
    if ((start_debounce_time != 0) && (millis() - start_debounce_time >= 2000))
    {
      WiFi.disconnect();
      //Serial.println("[niotConnection] wifi.disconnect(), return");
      return;
    }
    delay(500);
    //Serial.print(".");
  }
  
  //Serial.printf("[nodeIotConnection] WiFi Connected %s\n", WiFi.localIP().toString().c_str());

  appVerifyUrl.replace(" ", "%20");
  appLastDataUrl.replace(" ", "%20");
  
  while (state != "accepted")
  {
    if ((start_debounce_time != 0) && (millis() - start_debounce_time >= 2000))
    {
      return;
    }
    tryAuthenticate();
  }
  
  String appSocketPath = "/socket.io/?token=" + token + "&EIO=4";

  fetchLatestData();

  socketIO.begin(_appHost, _appPort, appSocketPath); 
  socketIO.onEvent(std::bind(&RemoteIO::socketIOEvent, this, std::placeholders::_1, std::placeholders::_2, std::placeholders::_3));
}

void RemoteIO::socketIOConnect()
{
  uint64_t now = millis();
  if (Socketed == 0)
  {
    StaticJsonDocument<JSON_DOCUMENT_CAPACITY> doc;
    JsonArray array = doc.to<JsonArray>();
    array.add("connection");
    JsonObject query = array.createNestedObject();
    query["Query"]["token"] = token;

    String output;
    serializeJson(doc, output);
    Socketed = socketIO.sendEVENT(output);
    Socketed = 1;
  }
  if ((Socketed == 1) && (now - messageTimestamp > 2000) && (Connected == 0))
  {
    StaticJsonDocument<JSON_DOCUMENT_CAPACITY> doc;
    JsonArray array = doc.to<JsonArray>();
    messageTimestamp = now;
    array.add("joinRoom");
    String output;
    serializeJson(doc, output);
    Connected = socketIO.sendEVENT(output);
    //if (Connected) //Serial.println("[socketIOConnect] Connected");
    //else Serial.println("[socketIOConnect] Failed connecting");
  }
}

void RemoteIO::tryAuthenticate()
{
  WiFiClientSecure client;
  HTTPClient https;

  client.setInsecure();
  
  StaticJsonDocument<JSON_DOCUMENT_CAPACITY> document;
  String request;

  deviceConfig->begin("deviceConfig", false);
  String storedTimestamp = deviceConfig->getString("Timestamp", "");
  String model = deviceConfig->getString("model", "");

  document["companyName"] = _companyName;
  document["deviceId"] = _deviceId;
  document["mac"] = WiFi.macAddress();
  document["ipAddress"] = WiFi.localIP().toString();
  document["settingsTimestamp"] = storedTimestamp;
  if (model == "")
  { 
    document["model"] = "ESP_32";
  }
  else
  { 
    document["model"] = model;
  }
  serializeJson(document, request);

