nodeiot/ESP32RemoteIO/src/ESP32RemoteIO.cpp
  https.begin(client, appVerifyUrl);
  https.addHeader("Content-Type", "application/json");

  int statusCode = https.POST(request);
  
  String response = https.getString(); // obter resposta do servidor
  document.clear();
  deserializeJson(document, response);
  //Serial.println(response);

  if (statusCode == HTTP_CODE_OK)
  {
    state = document["state"].as<String>();

    if (state != "accepted") 
    {
      document.clear();
      deviceConfig->end();
      https.end();
      return;
    }
    else if (document["settingsTimestamp"].as<String>() != storedTimestamp)
    {
      //Serial.println("[tryAuthenticate] timestamps diferentes");
      String ioSettings;
      serializeJson(document, ioSettings);
      deviceConfig->putString("ioSettings", ioSettings);
      document.clear();
      deserializeJson(document, ioSettings);
    }

    deviceConfig->end();
    token = document["token"].as<String>();
    extractIPAddress(document["serverAddr"].as<String>());
    //Serial.println(document["serverAddr"].as<String>());

    for (size_t i = 0; i < document["gpio"].size(); i++)
    {
      String ref = document["gpio"][i]["ref"];

      int pin = document["gpio"][i]["pin"].as<int>();
      String type = document["gpio"][i]["type"];

      if (type == "INPUT" || type == "INPUT_ANALOG")
      {
        setIO[ref]["pin"] = pin;
        setIO[ref]["Mode"] = type;
        pinMode(pin, INPUT);
      }
      else if (type == "INPUT_PULLUP")
      {
        setIO[ref]["pin"] = pin;
        setIO[ref]["Mode"] = type;
        pinMode(pin, INPUT_PULLUP);
      }
      else if (type == "INPUT_PULLDOWN")
      {
        setIO[ref]["pin"] = pin;
        setIO[ref]["Mode"] = type;
        pinMode(pin, INPUT_PULLDOWN);
      }
      else if (type == "OUTPUT")
      {
        setIO[ref]["pin"] = pin;
        setIO[ref]["Mode"] = type;
        pinMode(pin, OUTPUT);
      } 
      else 
      {
        setIO[ref]["pin"] = pin;
        setIO[ref]["Mode"] = "N/L";
      }
    }
  }
  else
  {
    //Serial.printf("[HTTP] POST... failed, code: %i,  error: %s\n", statusCode, https.errorToString(statusCode).c_str());
  }
  document.clear();
  https.end();
}

void RemoteIO::fetchLatestData()
{ 
  WiFiClient client;
  HTTPClient http;

  http.begin(client, appLastDataUrl);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("Authorization", "Bearer " + token);

  int statusCode = http.GET();

  if (statusCode == HTTP_CODE_OK)
  {
    StaticJsonDocument<JSON_DOCUMENT_CAPACITY> document;
    deserializeJson(document, http.getStream());

    for (size_t i = 0; i < document.size(); i++)
    {
      String auxRef = document[i]["ref"];
      String auxValue = document[i]["data"]["value"];

      if (auxValue == "null")
      {
        auxValue = "0";
      }
      
      setIO[auxRef]["value"] = auxValue;
      
      if (setIO[auxRef]["Mode"] == "OUTPUT")
      {
        updatePinOutput(auxRef);
      }
    }
    document.clear();
  }

  http.end();
}

void RemoteIO::extractIPAddress(String url)
{
  int startIndex = url.indexOf("//") + 2; // Encontra o início do endereço IP
  int endIndex = url.indexOf(":", startIndex); // Encontra o fim do endereço IP

  _appHost = url.substring(startIndex, endIndex); // Extrai o endereço IP
}

void RemoteIO::localHttpUpdateMsg (String ref, String value)
{
  StaticJsonDocument<250> doc;
  send_to_anchor_buffer.clear();
  setIO[ref]["value"] = value;
  doc["deviceId"] = _deviceId;
  doc["ref"] = ref;
  doc["value"] = value;
  serializeJson(doc, send_to_anchor_buffer);
  doc.clear();
  espPOST(anchor_route, "", send_to_anchor_buffer);
}

void RemoteIO::updatePinOutput(String ref)
{
  int PinRef = setIO[ref]["pin"].as<int>();
  int ValueRef = setIO[ref]["value"].as<int>();
  
  digitalWrite(PinRef, ValueRef);
}

void RemoteIO::updatePinInput(String ref)
{
  int pinRef = setIO[ref]["pin"].as<int>();
  String typeRef = setIO[ref]["Mode"].as<String>();
  int delayTime = setIO[ref]["delay"].as<int>() * 1000; // variável de configuração sincronizada com a plataforma
  int timestamp = setIO[ref]["timestamp"].as<int>();  // variável de configuração local, dessincronizada

  // garantir pelo menos 5 seg de delay
  if (delayTime < 5000) 
  {
    delayTime = 5000; // ms
    setIO[ref]["delay"] = 5; // s
  }

  if (millis() - timestamp >= delayTime)
  {
    setIO[ref]["timestamp"] = millis();
    
    // executa ação de leitura conforme tipo de variável ou processo utilizado
    if (typeRef == "INPUT" || typeRef == "INPUT_PULLDOWN" || typeRef == "INPUT_PULLUP")
    {
      int valueRef = digitalRead(pinRef);
      if (connection_state == CONNECTED) espPOST(ref, String(valueRef));
      else if (anchored) localHttpUpdateMsg(ref, String(valueRef));
    }
    else if (typeRef == "INPUT_ANALOG")
    {
      float valueRef = analogRead(pinRef);
      if (connection_state == CONNECTED) espPOST(ref, String(valueRef));
      else if (anchored) localHttpUpdateMsg(ref, String(valueRef));
    }
  }
}

void RemoteIO::notFound(AsyncWebServerRequest *request)
{
  request->send(404, "application/json", "{\"message\":\"Not found\"}");
}

int RemoteIO::espPOST(String variable, String value)
{
    return espPOST(appPostData, variable, value);
}

int RemoteIO::espPOST(String Router, String variable, String value)
{
  if ((WiFi.status() == WL_CONNECTED))
  {
    String route;

    if (Router == anchor_route) route = "http://" + anchor_IP + "/post-message";
    else if (Router == anchored_route) route = "http://" + anchored_IP + "/post-message";
    else route = Router;


    WiFiClientSecure client;
    HTTPClient https;
    StaticJsonDocument<1024> document;
    String request;

    client.setInsecure();

    if (Router == appPostData)
    {
      document["deviceId"] = _deviceId;
      document["ref"] = variable;
      document["value"] = value;
      setIO[variable]["value"] = value;
      serializeJson(document, request);
    }
    else request = value; 
    
    https.begin(client, route); // HTTP
    https.addHeader("Content-Type", "application/json");
    https.addHeader("authorization", "Bearer " + token);

    //Serial.print("[espPOST] Request: ");
    //Serial.println(request);
    
    int httpCode = https.POST(request);

    String response = https.getString(); 
    document.clear();
    deserializeJson(document, response);
    //Serial.println(response);

    if (httpCode == HTTP_CODE_OK)
    {
      if (Router == appSideDoor && document.containsKey("data"))
      {
        if (document["data"]["actived"].as<bool>() == true)
        {
          anchored_IP = document["data"]["ipdest"].as<String>();
          anchoring = true; 
        } 
      }
      else if (Router == anchor_route && document["msg"] == "ok")
      {
        anchored = true;
      }
    }
    else if (httpCode != HTTP_CODE_OK) 
    {
      //Serial.printf("[HTTP] POST... failed, code: %i,  error: %s\n", httpCode, https.errorToString(httpCode).c_str());
      
      //Serial.printf("msg: %s\n", document["msg"].as<String>());
      
      if (Router == anchored_route && variable != "restart")
      {
        // something
      }
      else if (Router == anchor_route)
      {
        anchored = false;
      }
    }
    document.clear();
    https.end();
    return httpCode;
  }
  return 0;
}